using System.Linq;
using Microsoft.AspNetCore.Builder;
using Microsoft.EntityFrameworkCore;
using Microsoft.Extensions.DependencyInjection;
using OnlinePerfumeShop.Data;
using OnlinePerfumeShop.Data.Models;
using System;

namespace OnlinePerfumeShop.Infrastructure
{
    public static class ApplicationBuilderExtensions
    {
        public static IApplicationBuilder PrepareDatabase(
             this IApplicationBuilder app)
        {
            using var serviceScope = app.ApplicationServices.CreateScope();
            var services = serviceScope.ServiceProvider;

            MigrateDatabase(services);

            SeedCategories(services);
            SeedBrands(services);
            SeedPerfumes(services);

            return app;
        }

        private static void MigrateDatabase(IServiceProvider services)
        {
            var data = services.GetRequiredService<OnlinePerfumeShopDbContext>();

            data.Database.Migrate();
        }

        private static void SeedCategories(IServiceProvider services)
        {
            var data = services.GetRequiredService<OnlinePerfumeShopDbContext>();

            if (data.Categories.Any())
            {
                return;
            }

            data.Categories.AddRange(new[]
            {
                new Category { Name = "мъжки" },
                new Category { Name = "женски" },

            });

            data.SaveChanges();
        }

        private static void SeedBrands(IServiceProvider services)
        {
            var data = services.GetRequiredService<OnlinePerfumeShopDbContext>();

            if (data.Brands.Any())
            {
                return;
            }

            data.Brands.AddRange(new[]
            {
                new Brand{ Name= "Sauvage" },
                new Brand{ Name= "Hugo Boss" },
                new Brand{ Name= "Versace" },
                new Brand{ Name = "Calvin Klein"},
            });

            data.SaveChanges();
        }

        private static void SeedPerfumes(IServiceProvider services)
        {
            var data = services.GetRequiredService<OnlinePerfumeShopDbContext>();

            if (data.Perfumes.Any())
            {
                return;
            }

            data.Perfumes.AddRange(new[]
            {
                 new Perfume{
                    Name = "DIOR Sauvage"
                    ,Desctription = "Франсоа Демаши, парфюмерист на Dior, намира вдъхновението във вълшебния момент, в който здрачът се спуска над пустинята. Смесен с прохладата на нощта, изгарящият пустинен въздух носи тайнствени аромати. Момент, оцветен в тъмно синьо, който отприщва и най-смелите инстинкти. В часа, в който вълците излизат, а небето гори с лъчите на залязващото слънце, се появява нова магия."
                    ,ImageUrl = "https://i.imgur.com/Iy1QyP8.jpg"
                    ,Price = 185.00M
                    ,BrandId = 2
                    ,CategoryId = 1
                    ,Qunatity = 100
                },new Perfume{
                    Name = "Versace Eros"
                    ,Desctription = "Бъдете чувствен като гръцкия бог на любовта Ерос. Тоалетната вода за мъже Versace Eros е съвършено въплъщение на мощ и страст. Ароматната ѝ композиция символизира любовта и копнежа и сякаш е създадена за силния и уверен в себе си мъж, който знае какво иска. Тайнствените нотки на аромата ще грабнат всекиго, а едно е сигурно – жените около вас няма да пропуснат присъствието ви."
                    ,ImageUrl = "https://i.imgur.com/EbSw8mR.jpg"
                    ,Price = 129.00M
                    ,BrandId = 3
                    ,CategoryId = 1
                    ,Qunatity = 200

                },new Perfume{
                    Name = "Hugo Boss Deep Red"
                    ,Desctription = "Hugo Boss Deep Red е дамски парфюм е предназначен за силните и активни жени. Представен е на пазара 2001г. Създаден е от парфюмеристите Alain Astori, Beatrice Piquet. Привлекателен и отблъскващ, дразнещ и възбуждащ, но никога незабележим аромат. Съблазнителната и възбуждаща ароматна аура, ще ви зареди с невероятно настроение и усещане за неповторима уникалност."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 49.99M
                    ,BrandId = 1
                    ,CategoryId = 2
                    ,Qunatity = 50
                },
                 new Perfume{
                    Name = "Calvin Klein In2U"
                    ,Desctription = "Calvin Klein In2U e модерен аромат насочен към младото поколение, създаден да изрази свободната воля и желанието на младите хора да изследват и опознават света.  Усеща духа и  настроението на енергичните млади мъже и жени. Представен на пазара 2007г. Свеж, динамичен, чист и тонизиращ. Прекрасно предложени за топлите месеци, ваканциите и забавленията с приятели на открито. Ароматният състав е разработен от уникален екип парфюмеристи - Bruno Jovanovic , Jean-Marc Chaillan , Loc Dong и Carlos Benaim.  Calvin Klein In2U е представен на пазара за първи път през 2007 година."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 41.99M
                    ,BrandId = 4
                    ,CategoryId = 2
                    ,Qunatity = 100
                },
                 new Perfume{
                    Name = "Hugo Boss Bottled Nigh"
                    ,Desctription = "Hugo Boss Bottled Night EDT е дървесен аромат за мъже лансиран на пазара през юли 2010 година. За младия, амбициозен, модерен мъж, който преследва целите си. Той е уверен в своите способности и знае, че всяка цел е постижима и всичко е възможно! Успехът е на една ръка разстояние от Вас! Съблазнителен и много мъжествен аромат, подчертаващ сила и чувственост. Не по-малко харизматича е бутилката - флакон, оцветен в наситени, тъмносини нюанси, обрисуващи загадачността на нощта. Неговият елегантен и благороден блясък разкрива на своя собственик тайните на прелъстяването, подготвя го за приключенията, съпътстващи тъмната част на денонощието. "
                    ,ImageUrl = "https://i.imgur.com/NgWSnk9.jpg"
                    ,Price = 59.99M
                    ,BrandId = 1
                    ,CategoryId = 1
                    ,Qunatity = 50
                },
                new Perfume{
                    Name = "Calvin Klein Encounter парфюм за мъже"
                    ,Desctription = "Calvin Klein Encounter e мистериозен, мъжествен и съблазнително секси аромат, представен на пазара през 2012 година. Разработка е на парфюмеристите Honorine Blane и Piere Negrine. Усещането за този аромат е като дългоочаквана среща между мъж и жена, заредена с много вълнение, страст и магнетизъм. Подходящ е за всички моменти, в които искате да бъдете неустоими."
                    ,ImageUrl = "https://i.imgur.com/KKVstuY.jpg"
                    ,Price = 99.99M
                    ,BrandId = 4
                    ,CategoryId = 1
                    ,Qunatity = 100
                },

                    new Perfume{
                    Name = "DIOR Sauvage"
                    ,Desctription = "Франсоа Демаши, парфюмерист на Dior, намира вдъхновението във вълшебния момент, в който здрачът се спуска над пустинята. Смесен с прохладата на нощта, изгарящият пустинен въздух носи тайнствени аромати. Момент, оцветен в тъмно синьо, който отприщва и най-смелите инстинкти. В часа, в който вълците излизат, а небето гори с лъчите на залязващото слънце, се появява нова магия."
                    ,ImageUrl = "https://i.imgur.com/Iy1QyP8.jpg"
                    ,Price = 185.00M
                    ,BrandId = 2
                    ,CategoryId = 1
                    ,Qunatity = 100
                },new Perfume{
                    Name = "Versace Eros"
                    ,Desctription = "Бъдете чувствен като гръцкия бог на любовта Ерос. Тоалетната вода за мъже Versace Eros е съвършено въплъщение на мощ и страст. Ароматната ѝ композиция символизира любовта и копнежа и сякаш е създадена за силния и уверен в себе си мъж, който знае какво иска. Тайнствените нотки на аромата ще грабнат всекиго, а едно е сигурно – жените около вас няма да пропуснат присъствието ви."
                    ,ImageUrl = "https://i.imgur.com/EbSw8mR.jpg"
                    ,Price = 129.00M
                    ,BrandId = 3
                    ,CategoryId = 1
                    ,Qunatity = 200

                },new Perfume{
                    Name = "Hugo Boss Deep Red"
                    ,Desctription = "Hugo Boss Deep Red е дамски парфюм е предназначен за силните и активни жени. Представен е на пазара 2001г. Създаден е от парфюмеристите Alain Astori, Beatrice Piquet. Привлекателен и отблъскващ, дразнещ и възбуждащ, но никога незабележим аромат. Съблазнителната и възбуждаща ароматна аура, ще ви зареди с невероятно настроение и усещане за неповторима уникалност."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 49.99M
                    ,BrandId = 1
                    ,CategoryId = 2
                    ,Qunatity = 50
                },
                 new Perfume{
                    Name = "Calvin Klein In2U"
                    ,Desctription = "Calvin Klein In2U e модерен аромат насочен към младото поколение, създаден да изрази свободната воля и желанието на младите хора да изследват и опознават света.  Усеща духа и  настроението на енергичните млади мъже и жени. Представен на пазара 2007г. Свеж, динамичен, чист и тонизиращ. Прекрасно предложени за топлите месеци, ваканциите и забавленията с приятели на открито. Ароматният състав е разработен от уникален екип парфюмеристи - Bruno Jovanovic , Jean-Marc Chaillan , Loc Dong и Carlos Benaim.  Calvin Klein In2U е представен на пазара за първи път през 2007 година."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 41.99M
                    ,BrandId = 4
                    ,CategoryId = 2
                    ,Qunatity = 100
                },
                 new Perfume{
                    Name = "Hugo Boss Bottled Nigh"
                    ,Desctription = "Hugo Boss Bottled Night EDT е дървесен аромат за мъже лансиран на пазара през юли 2010 година. За младия, амбициозен, модерен мъж, който преследва целите си. Той е уверен в своите способности и знае, че всяка цел е постижима и всичко е възможно! Успехът е на една ръка разстояние от Вас! Съблазнителен и много мъжествен аромат, подчертаващ сила и чувственост. Не по-малко харизматича е бутилката - флакон, оцветен в наситени, тъмносини нюанси, обрисуващи загадачността на нощта. Неговият елегантен и благороден блясък разкрива на своя собственик тайните на прелъстяването, подготвя го за приключенията, съпътстващи тъмната част на денонощието. "
                    ,ImageUrl = "https://i.imgur.com/NgWSnk9.jpg"
                    ,Price = 59.99M
                    ,BrandId = 1
                    ,CategoryId = 1
                    ,Qunatity = 50
                },
                new Perfume{
                    Name = "Calvin Klein Encounter парфюм за мъже"
                    ,Desctription = "Calvin Klein Encounter e мистериозен, мъжествен и съблазнително секси аромат, представен на пазара през 2012 година. Разработка е на парфюмеристите Honorine Blane и Piere Negrine. Усещането за този аромат е като дългоочаквана среща между мъж и жена, заредена с много вълнение, страст и магнетизъм. Подходящ е за всички моменти, в които искате да бъдете неустоими."
                    ,ImageUrl = "https://i.imgur.com/KKVstuY.jpg"
                    ,Price = 99.99M
                    ,BrandId = 4
                    ,CategoryId = 1
                    ,Qunatity = 100
                },

                    new Perfume{
                    Name = "DIOR Sauvage"
                    ,Desctription = "Франсоа Демаши, парфюмерист на Dior, намира вдъхновението във вълшебния момент, в който здрачът се спуска над пустинята. Смесен с прохладата на нощта, изгарящият пустинен въздух носи тайнствени аромати. Момент, оцветен в тъмно синьо, който отприщва и най-смелите инстинкти. В часа, в който вълците излизат, а небето гори с лъчите на залязващото слънце, се появява нова магия."
                    ,ImageUrl = "https://i.imgur.com/Iy1QyP8.jpg"
                    ,Price = 185.00M
                    ,BrandId = 2
                    ,CategoryId = 1
                    ,Qunatity = 100
                },new Perfume{
                    Name = "Versace Eros"
                    ,Desctription = "Бъдете чувствен като гръцкия бог на любовта Ерос. Тоалетната вода за мъже Versace Eros е съвършено въплъщение на мощ и страст. Ароматната ѝ композиция символизира любовта и копнежа и сякаш е създадена за силния и уверен в себе си мъж, който знае какво иска. Тайнствените нотки на аромата ще грабнат всекиго, а едно е сигурно – жените около вас няма да пропуснат присъствието ви."
                    ,ImageUrl = "https://i.imgur.com/EbSw8mR.jpg"
                    ,Price = 129.00M
                    ,BrandId = 3
                    ,CategoryId = 1
                    ,Qunatity = 200

                },new Perfume{
                    Name = "Hugo Boss Deep Red"
                    ,Desctription = "Hugo Boss Deep Red е дамски парфюм е предназначен за силните и активни жени. Представен е на пазара 2001г. Създаден е от парфюмеристите Alain Astori, Beatrice Piquet. Привлекателен и отблъскващ, дразнещ и възбуждащ, но никога незабележим аромат. Съблазнителната и възбуждаща ароматна аура, ще ви зареди с невероятно настроение и усещане за неповторима уникалност."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 49.99M
                    ,BrandId = 1
                    ,CategoryId = 2
                    ,Qunatity = 50
                },
                 new Perfume{
                    Name = "Calvin Klein In2U"
                    ,Desctription = "Calvin Klein In2U e модерен аромат насочен към младото поколение, създаден да изрази свободната воля и желанието на младите хора да изследват и опознават света.  Усеща духа и  настроението на енергичните млади мъже и жени. Представен на пазара 2007г. Свеж, динамичен, чист и тонизиращ. Прекрасно предложени за топлите месеци, ваканциите и забавленията с приятели на открито. Ароматният състав е разработен от уникален екип парфюмеристи - Bruno Jovanovic , Jean-Marc Chaillan , Loc Dong и Carlos Benaim.  Calvin Klein In2U е представен на пазара за първи път през 2007 година."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 41.99M
                    ,BrandId = 4
                    ,CategoryId = 2
                    ,Qunatity = 100
                },
                 new Perfume{
                    Name = "Hugo Boss Bottled Nigh"
                    ,Desctription = "Hugo Boss Bottled Night EDT е дървесен аромат за мъже лансиран на пазара през юли 2010 година. За младия, амбициозен, модерен мъж, който преследва целите си. Той е уверен в своите способности и знае, че всяка цел е постижима и всичко е възможно! Успехът е на една ръка разстояние от Вас! Съблазнителен и много мъжествен аромат, подчертаващ сила и чувственост. Не по-малко харизматича е бутилката - флакон, оцветен в наситени, тъмносини нюанси, обрисуващи загадачността на нощта. Неговият елегантен и благороден блясък разкрива на своя собственик тайните на прелъстяването, подготвя го за приключенията, съпътстващи тъмната част на денонощието. "
                    ,ImageUrl = "https://i.imgur.com/NgWSnk9.jpg"
                    ,Price = 59.99M
                    ,BrandId = 1
                    ,CategoryId = 1
                    ,Qunatity = 50
                },
                new Perfume{
                    Name = "Calvin Klein Encounter парфюм за мъже"
                    ,Desctription = "Calvin Klein Encounter e мистериозен, мъжествен и съблазнително секси аромат, представен на пазара през 2012 година. Разработка е на парфюмеристите Honorine Blane и Piere Negrine. Усещането за този аромат е като дългоочаквана среща между мъж и жена, заредена с много вълнение, страст и магнетизъм. Подходящ е за всички моменти, в които искате да бъдете неустоими."
                    ,ImageUrl = "https://i.imgur.com/KKVstuY.jpg"
                    ,Price = 99.99M
                    ,BrandId = 4
                    ,CategoryId = 1
                    ,Qunatity = 100
                },
                    new Perfume{
                    Name = "DIOR Sauvage"
                    ,Desctription = "Франсоа Демаши, парфюмерист на Dior, намира вдъхновението във вълшебния момент, в който здрачът се спуска над пустинята. Смесен с прохладата на нощта, изгарящият пустинен въздух носи тайнствени аромати. Момент, оцветен в тъмно синьо, който отприщва и най-смелите инстинкти. В часа, в който вълците излизат, а небето гори с лъчите на залязващото слънце, се появява нова магия."
                    ,ImageUrl = "https://i.imgur.com/Iy1QyP8.jpg"
                    ,Price = 185.00M
                    ,BrandId = 2
                    ,CategoryId = 1
                    ,Qunatity = 100
                },new Perfume{
                    Name = "Versace Eros"
                    ,Desctription = "Бъдете чувствен като гръцкия бог на любовта Ерос. Тоалетната вода за мъже Versace Eros е съвършено въплъщение на мощ и страст. Ароматната ѝ композиция символизира любовта и копнежа и сякаш е създадена за силния и уверен в себе си мъж, който знае какво иска. Тайнствените нотки на аромата ще грабнат всекиго, а едно е сигурно – жените около вас няма да пропуснат присъствието ви."
                    ,ImageUrl = "https://i.imgur.com/EbSw8mR.jpg"
                    ,Price = 129.00M
                    ,BrandId = 3
                    ,CategoryId = 1
                    ,Qunatity = 200

                },new Perfume{
                    Name = "Hugo Boss Deep Red"
                    ,Desctription = "Hugo Boss Deep Red е дамски парфюм е предназначен за силните и активни жени. Представен е на пазара 2001г. Създаден е от парфюмеристите Alain Astori, Beatrice Piquet. Привлекателен и отблъскващ, дразнещ и възбуждащ, но никога незабележим аромат. Съблазнителната и възбуждаща ароматна аура, ще ви зареди с невероятно настроение и усещане за неповторима уникалност."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 49.99M
                    ,BrandId = 1
                    ,CategoryId = 2
                    ,Qunatity = 50
                },
                 new Perfume{
                    Name = "Calvin Klein In2U"
                    ,Desctription = "Calvin Klein In2U e модерен аромат насочен към младото поколение, създаден да изрази свободната воля и желанието на младите хора да изследват и опознават света.  Усеща духа и  настроението на енергичните млади мъже и жени. Представен на пазара 2007г. Свеж, динамичен, чист и тонизиращ. Прекрасно предложени за топлите месеци, ваканциите и забавленията с приятели на открито. Ароматният състав е разработен от уникален екип парфюмеристи - Bruno Jovanovic , Jean-Marc Chaillan , Loc Dong и Carlos Benaim.  Calvin Klein In2U е представен на пазара за първи път през 2007 година."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 41.99M
                    ,BrandId = 4
                    ,CategoryId = 2
                    ,Qunatity = 100
                },
                 new Perfume{
                    Name = "Hugo Boss Bottled Nigh"
                    ,Desctription = "Hugo Boss Bottled Night EDT е дървесен аромат за мъже лансиран на пазара през юли 2010 година. За младия, амбициозен, модерен мъж, който преследва целите си. Той е уверен в своите способности и знае, че всяка цел е постижима и всичко е възможно! Успехът е на една ръка разстояние от Вас! Съблазнителен и много мъжествен аромат, подчертаващ сила и чувственост. Не по-малко харизматича е бутилката - флакон, оцветен в наситени, тъмносини нюанси, обрисуващи загадачността на нощта. Неговият елегантен и благороден блясък разкрива на своя собственик тайните на прелъстяването, подготвя го за приключенията, съпътстващи тъмната част на денонощието. "
                    ,ImageUrl = "https://i.imgur.com/NgWSnk9.jpg"
                    ,Price = 59.99M
                    ,BrandId = 1
                    ,CategoryId = 1
                    ,Qunatity = 50
                },
                new Perfume{
                    Name = "Calvin Klein Encounter парфюм за мъже"
                    ,Desctription = "Calvin Klein Encounter e мистериозен, мъжествен и съблазнително секси аромат, представен на пазара през 2012 година. Разработка е на парфюмеристите Honorine Blane и Piere Negrine. Усещането за този аромат е като дългоочаквана среща между мъж и жена, заредена с много вълнение, страст и магнетизъм. Подходящ е за всички моменти, в които искате да бъдете неустоими."
                    ,ImageUrl = "https://i.imgur.com/KKVstuY.jpg"
                    ,Price = 99.99M
                    ,BrandId = 4
                    ,CategoryId = 1
                    ,Qunatity = 100
                },
                   new Perfume{
                    Name = "DIOR Sauvage"
                    ,Desctription = "Франсоа Демаши, парфюмерист на Dior, намира вдъхновението във вълшебния момент, в който здрачът се спуска над пустинята. Смесен с прохладата на нощта, изгарящият пустинен въздух носи тайнствени аромати. Момент, оцветен в тъмно синьо, който отприщва и най-смелите инстинкти. В часа, в който вълците излизат, а небето гори с лъчите на залязващото слънце, се появява нова магия."
                    ,ImageUrl = "https://i.imgur.com/Iy1QyP8.jpg"
                    ,Price = 185.00M
                    ,BrandId = 2
                    ,CategoryId = 1
                    ,Qunatity = 100
                },new Perfume{
                    Name = "Versace Eros"
                    ,Desctription = "Бъдете чувствен като гръцкия бог на любовта Ерос. Тоалетната вода за мъже Versace Eros е съвършено въплъщение на мощ и страст. Ароматната ѝ композиция символизира любовта и копнежа и сякаш е създадена за силния и уверен в себе си мъж, който знае какво иска. Тайнствените нотки на аромата ще грабнат всекиго, а едно е сигурно – жените около вас няма да пропуснат присъствието ви."
                    ,ImageUrl = "https://i.imgur.com/EbSw8mR.jpg"
                    ,Price = 129.00M
                    ,BrandId = 3
                    ,CategoryId = 1
                    ,Qunatity = 200

                },new Perfume{
                    Name = "Hugo Boss Deep Red"
                    ,Desctription = "Hugo Boss Deep Red е дамски парфюм е предназначен за силните и активни жени. Представен е на пазара 2001г. Създаден е от парфюмеристите Alain Astori, Beatrice Piquet. Привлекателен и отблъскващ, дразнещ и възбуждащ, но никога незабележим аромат. Съблазнителната и възбуждаща ароматна аура, ще ви зареди с невероятно настроение и усещане за неповторима уникалност."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 49.99M
                    ,BrandId = 1
                    ,CategoryId = 2
                    ,Qunatity = 50
                },
                 new Perfume{
                    Name = "Calvin Klein In2U"
                    ,Desctription = "Calvin Klein In2U e модерен аромат насочен към младото поколение, създаден да изрази свободната воля и желанието на младите хора да изследват и опознават света.  Усеща духа и  настроението на енергичните млади мъже и жени. Представен на пазара 2007г. Свеж, динамичен, чист и тонизиращ. Прекрасно предложени за топлите месеци, ваканциите и забавленията с приятели на открито. Ароматният състав е разработен от уникален екип парфюмеристи - Bruno Jovanovic , Jean-Marc Chaillan , Loc Dong и Carlos Benaim.  Calvin Klein In2U е представен на пазара за първи път през 2007 година."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 41.99M
                    ,BrandId = 4
                    ,CategoryId = 2
                    ,Qunatity = 100
                },
                 new Perfume{
                    Name = "Hugo Boss Bottled Nigh"
                    ,Desctription = "Hugo Boss Bottled Night EDT е дървесен аромат за мъже лансиран на пазара през юли 2010 година. За младия, амбициозен, модерен мъж, който преследва целите си. Той е уверен в своите способности и знае, че всяка цел е постижима и всичко е възможно! Успехът е на една ръка разстояние от Вас! Съблазнителен и много мъжествен аромат, подчертаващ сила и чувственост. Не по-малко харизматича е бутилката - флакон, оцветен в наситени, тъмносини нюанси, обрисуващи загадачността на нощта. Неговият елегантен и благороден блясък разкрива на своя собственик тайните на прелъстяването, подготвя го за приключенията, съпътстващи тъмната част на денонощието. "
                    ,ImageUrl = "https://i.imgur.com/NgWSnk9.jpg"
                    ,Price = 59.99M
                    ,BrandId = 1
                    ,CategoryId = 1
                    ,Qunatity = 50
                },
                new Perfume{
                    Name = "Calvin Klein Encounter парфюм за мъже"
                    ,Desctription = "Calvin Klein Encounter e мистериозен, мъжествен и съблазнително секси аромат, представен на пазара през 2012 година. Разработка е на парфюмеристите Honorine Blane и Piere Negrine. Усещането за този аромат е като дългоочаквана среща между мъж и жена, заредена с много вълнение, страст и магнетизъм. Подходящ е за всички моменти, в които искате да бъдете неустоими."
                    ,ImageUrl = "https://i.imgur.com/KKVstuY.jpg"
                    ,Price = 99.99M
                    ,BrandId = 4
                    ,CategoryId = 1
                    ,Qunatity = 100
                },

                    new Perfume{
                    Name = "DIOR Sauvage"
                    ,Desctription = "Франсоа Демаши, парфюмерист на Dior, намира вдъхновението във вълшебния момент, в който здрачът се спуска над пустинята. Смесен с прохладата на нощта, изгарящият пустинен въздух носи тайнствени аромати. Момент, оцветен в тъмно синьо, който отприщва и най-смелите инстинкти. В часа, в който вълците излизат, а небето гори с лъчите на залязващото слънце, се появява нова магия."
                    ,ImageUrl = "https://i.imgur.com/Iy1QyP8.jpg"
                    ,Price = 185.00M
                    ,BrandId = 2
                    ,CategoryId = 1
                    ,Qunatity = 100
                },new Perfume{
                    Name = "Versace Eros"
                    ,Desctription = "Бъдете чувствен като гръцкия бог на любовта Ерос. Тоалетната вода за мъже Versace Eros е съвършено въплъщение на мощ и страст. Ароматната ѝ композиция символизира любовта и копнежа и сякаш е създадена за силния и уверен в себе си мъж, който знае какво иска. Тайнствените нотки на аромата ще грабнат всекиго, а едно е сигурно – жените около вас няма да пропуснат присъствието ви."
                    ,ImageUrl = "https://i.imgur.com/EbSw8mR.jpg"
                    ,Price = 129.00M
                    ,BrandId = 3
                    ,CategoryId = 1
                    ,Qunatity = 200

                },new Perfume{
                    Name = "Hugo Boss Deep Red"
                    ,Desctription = "Hugo Boss Deep Red е дамски парфюм е предназначен за силните и активни жени. Представен е на пазара 2001г. Създаден е от парфюмеристите Alain Astori, Beatrice Piquet. Привлекателен и отблъскващ, дразнещ и възбуждащ, но никога незабележим аромат. Съблазнителната и възбуждаща ароматна аура, ще ви зареди с невероятно настроение и усещане за неповторима уникалност."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 49.99M
                    ,BrandId = 1
                    ,CategoryId = 2
                    ,Qunatity = 50
                },
                 new Perfume{
                    Name = "Calvin Klein In2U"
                    ,Desctription = "Calvin Klein In2U e модерен аромат насочен към младото поколение, създаден да изрази свободната воля и желанието на младите хора да изследват и опознават света.  Усеща духа и  настроението на енергичните млади мъже и жени. Представен на пазара 2007г. Свеж, динамичен, чист и тонизиращ. Прекрасно предложени за топлите месеци, ваканциите и забавленията с приятели на открито. Ароматният състав е разработен от уникален екип парфюмеристи - Bruno Jovanovic , Jean-Marc Chaillan , Loc Dong и Carlos Benaim.  Calvin Klein In2U е представен на пазара за първи път през 2007 година."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 41.99M
                    ,BrandId = 4
                    ,CategoryId = 2
                    ,Qunatity = 100
                },
                 new Perfume{
                    Name = "Hugo Boss Bottled Nigh"
                    ,Desctription = "Hugo Boss Bottled Night EDT е дървесен аромат за мъже лансиран на пазара през юли 2010 година. За младия, амбициозен, модерен мъж, който преследва целите си. Той е уверен в своите способности и знае, че всяка цел е постижима и всичко е възможно! Успехът е на една ръка разстояние от Вас! Съблазнителен и много мъжествен аромат, подчертаващ сила и чувственост. Не по-малко харизматича е бутилката - флакон, оцветен в наситени, тъмносини нюанси, обрисуващи загадачността на нощта. Неговият елегантен и благороден блясък разкрива на своя собственик тайните на прелъстяването, подготвя го за приключенията, съпътстващи тъмната част на денонощието. "
                    ,ImageUrl = "https://i.imgur.com/NgWSnk9.jpg"
                    ,Price = 59.99M
                    ,BrandId = 1
                    ,CategoryId = 1
                    ,Qunatity = 50
                },
                new Perfume{
                    Name = "Calvin Klein Encounter парфюм за мъже"
                    ,Desctription = "Calvin Klein Encounter e мистериозен, мъжествен и съблазнително секси аромат, представен на пазара през 2012 година. Разработка е на парфюмеристите Honorine Blane и Piere Negrine. Усещането за този аромат е като дългоочаквана среща между мъж и жена, заредена с много вълнение, страст и магнетизъм. Подходящ е за всички моменти, в които искате да бъдете неустоими."
                    ,ImageUrl = "https://i.imgur.com/KKVstuY.jpg"
                    ,Price = 99.99M
                    ,BrandId = 4
                    ,CategoryId = 1
                    ,Qunatity = 100
                },

                    new Perfume{
                    Name = "DIOR Sauvage"
                    ,Desctription = "Франсоа Демаши, парфюмерист на Dior, намира вдъхновението във вълшебния момент, в който здрачът се спуска над пустинята. Смесен с прохладата на нощта, изгарящият пустинен въздух носи тайнствени аромати. Момент, оцветен в тъмно синьо, който отприщва и най-смелите инстинкти. В часа, в който вълците излизат, а небето гори с лъчите на залязващото слънце, се появява нова магия."
                    ,ImageUrl = "https://i.imgur.com/Iy1QyP8.jpg"
                    ,Price = 185.00M
                    ,BrandId = 2
                    ,CategoryId = 1
                    ,Qunatity = 100
                },new Perfume{
                    Name = "Versace Eros"
                    ,Desctription = "Бъдете чувствен като гръцкия бог на любовта Ерос. Тоалетната вода за мъже Versace Eros е съвършено въплъщение на мощ и страст. Ароматната ѝ композиция символизира любовта и копнежа и сякаш е създадена за силния и уверен в себе си мъж, който знае какво иска. Тайнствените нотки на аромата ще грабнат всекиго, а едно е сигурно – жените около вас няма да пропуснат присъствието ви."
                    ,ImageUrl = "https://i.imgur.com/EbSw8mR.jpg"
                    ,Price = 129.00M
                    ,BrandId = 3
                    ,CategoryId = 1
                    ,Qunatity = 200

                },new Perfume{
                    Name = "Hugo Boss Deep Red"
                    ,Desctription = "Hugo Boss Deep Red е дамски парфюм е предназначен за силните и активни жени. Представен е на пазара 2001г. Създаден е от парфюмеристите Alain Astori, Beatrice Piquet. Привлекателен и отблъскващ, дразнещ и възбуждащ, но никога незабележим аромат. Съблазнителната и възбуждаща ароматна аура, ще ви зареди с невероятно настроение и усещане за неповторима уникалност."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 49.99M
                    ,BrandId = 1
                    ,CategoryId = 2
                    ,Qunatity = 50
                },
                 new Perfume{
                    Name = "Calvin Klein In2U"
                    ,Desctription = "Calvin Klein In2U e модерен аромат насочен към младото поколение, създаден да изрази свободната воля и желанието на младите хора да изследват и опознават света.  Усеща духа и  настроението на енергичните млади мъже и жени. Представен на пазара 2007г. Свеж, динамичен, чист и тонизиращ. Прекрасно предложени за топлите месеци, ваканциите и забавленията с приятели на открито. Ароматният състав е разработен от уникален екип парфюмеристи - Bruno Jovanovic , Jean-Marc Chaillan , Loc Dong и Carlos Benaim.  Calvin Klein In2U е представен на пазара за първи път през 2007 година."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 41.99M
                    ,BrandId = 4
                    ,CategoryId = 2
                    ,Qunatity = 100
                },
                 new Perfume{
                    Name = "Hugo Boss Bottled Nigh"
                    ,Desctription = "Hugo Boss Bottled Night EDT е дървесен аромат за мъже лансиран на пазара през юли 2010 година. За младия, амбициозен, модерен мъж, който преследва целите си. Той е уверен в своите способности и знае, че всяка цел е постижима и всичко е възможно! Успехът е на една ръка разстояние от Вас! Съблазнителен и много мъжествен аромат, подчертаващ сила и чувственост. Не по-малко харизматича е бутилката - флакон, оцветен в наситени, тъмносини нюанси, обрисуващи загадачността на нощта. Неговият елегантен и благороден блясък разкрива на своя собственик тайните на прелъстяването, подготвя го за приключенията, съпътстващи тъмната част на денонощието. "
                    ,ImageUrl = "https://i.imgur.com/NgWSnk9.jpg"
                    ,Price = 59.99M
                    ,BrandId = 1
                    ,CategoryId = 1
                    ,Qunatity = 50
                },
                new Perfume{
                    Name = "Calvin Klein Encounter парфюм за мъже"
                    ,Desctription = "Calvin Klein Encounter e мистериозен, мъжествен и съблазнително секси аромат, представен на пазара през 2012 година. Разработка е на парфюмеристите Honorine Blane и Piere Negrine. Усещането за този аромат е като дългоочаквана среща между мъж и жена, заредена с много вълнение, страст и магнетизъм. Подходящ е за всички моменти, в които искате да бъдете неустоими."
                    ,ImageUrl = "https://i.imgur.com/KKVstuY.jpg"
                    ,Price = 99.99M
                    ,BrandId = 4
                    ,CategoryId = 1
                    ,Qunatity = 100
                },
                    new Perfume{
                    Name = "DIOR Sauvage"
                    ,Desctription = "Франсоа Демаши, парфюмерист на Dior, намира вдъхновението във вълшебния момент, в който здрачът се спуска над пустинята. Смесен с прохладата на нощта, изгарящият пустинен въздух носи тайнствени аромати. Момент, оцветен в тъмно синьо, който отприщва и най-смелите инстинкти. В часа, в който вълците излизат, а небето гори с лъчите на залязващото слънце, се появява нова магия."
                    ,ImageUrl = "https://i.imgur.com/Iy1QyP8.jpg"
                    ,Price = 185.00M
                    ,BrandId = 2
                    ,CategoryId = 1
                    ,Qunatity = 100
                },new Perfume{
                    Name = "Versace Eros"
                    ,Desctription = "Бъдете чувствен като гръцкия бог на любовта Ерос. Тоалетната вода за мъже Versace Eros е съвършено въплъщение на мощ и страст. Ароматната ѝ композиция символизира любовта и копнежа и сякаш е създадена за силния и уверен в себе си мъж, който знае какво иска. Тайнствените нотки на аромата ще грабнат всекиго, а едно е сигурно – жените около вас няма да пропуснат присъствието ви."
                    ,ImageUrl = "https://i.imgur.com/EbSw8mR.jpg"
                    ,Price = 129.00M
                    ,BrandId = 3
                    ,CategoryId = 1
                    ,Qunatity = 200

                },new Perfume{
                    Name = "Hugo Boss Deep Red"
                    ,Desctription = "Hugo Boss Deep Red е дамски парфюм е предназначен за силните и активни жени. Представен е на пазара 2001г. Създаден е от парфюмеристите Alain Astori, Beatrice Piquet. Привлекателен и отблъскващ, дразнещ и възбуждащ, но никога незабележим аромат. Съблазнителната и възбуждаща ароматна аура, ще ви зареди с невероятно настроение и усещане за неповторима уникалност."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 49.99M
                    ,BrandId = 1
                    ,CategoryId = 2
                    ,Qunatity = 50
                },
                 new Perfume{
                    Name = "Calvin Klein In2U"
                    ,Desctription = "Calvin Klein In2U e модерен аромат насочен към младото поколение, създаден да изрази свободната воля и желанието на младите хора да изследват и опознават света.  Усеща духа и  настроението на енергичните млади мъже и жени. Представен на пазара 2007г. Свеж, динамичен, чист и тонизиращ. Прекрасно предложени за топлите месеци, ваканциите и забавленията с приятели на открито. Ароматният състав е разработен от уникален екип парфюмеристи - Bruno Jovanovic , Jean-Marc Chaillan , Loc Dong и Carlos Benaim.  Calvin Klein In2U е представен на пазара за първи път през 2007 година."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 41.99M
                    ,BrandId = 4
                    ,CategoryId = 2
                    ,Qunatity = 100
                },
                 new Perfume{
                    Name = "Hugo Boss Bottled Nigh"
                    ,Desctription = "Hugo Boss Bottled Night EDT е дървесен аромат за мъже лансиран на пазара през юли 2010 година. За младия, амбициозен, модерен мъж, който преследва целите си. Той е уверен в своите способности и знае, че всяка цел е постижима и всичко е възможно! Успехът е на една ръка разстояние от Вас! Съблазнителен и много мъжествен аромат, подчертаващ сила и чувственост. Не по-малко харизматича е бутилката - флакон, оцветен в наситени, тъмносини нюанси, обрисуващи загадачността на нощта. Неговият елегантен и благороден блясък разкрива на своя собственик тайните на прелъстяването, подготвя го за приключенията, съпътстващи тъмната част на денонощието. "
                    ,ImageUrl = "https://i.imgur.com/NgWSnk9.jpg"
                    ,Price = 59.99M
                    ,BrandId = 1
                    ,CategoryId = 1
                    ,Qunatity = 50
                },
                new Perfume{
                    Name = "Calvin Klein Encounter парфюм за мъже"
                    ,Desctription = "Calvin Klein Encounter e мистериозен, мъжествен и съблазнително секси аромат, представен на пазара през 2012 година. Разработка е на парфюмеристите Honorine Blane и Piere Negrine. Усещането за този аромат е като дългоочаквана среща между мъж и жена, заредена с много вълнение, страст и магнетизъм. Подходящ е за всички моменти, в които искате да бъдете неустоими."
                    ,ImageUrl = "https://i.imgur.com/KKVstuY.jpg"
                    ,Price = 99.99M
                    ,BrandId = 4
                    ,CategoryId = 1
                    ,Qunatity = 100
                },
                   new Perfume{
                    Name = "DIOR Sauvage"
                    ,Desctription = "Франсоа Демаши, парфюмерист на Dior, намира вдъхновението във вълшебния момент, в който здрачът се спуска над пустинята. Смесен с прохладата на нощта, изгарящият пустинен въздух носи тайнствени аромати. Момент, оцветен в тъмно синьо, който отприщва и най-смелите инстинкти. В часа, в който вълците излизат, а небето гори с лъчите на залязващото слънце, се появява нова магия."
                    ,ImageUrl = "https://i.imgur.com/Iy1QyP8.jpg"
                    ,Price = 185.00M
                    ,BrandId = 2
                    ,CategoryId = 1
                    ,Qunatity = 100
                },new Perfume{
                    Name = "Versace Eros"
                    ,Desctription = "Бъдете чувствен като гръцкия бог на любовта Ерос. Тоалетната вода за мъже Versace Eros е съвършено въплъщение на мощ и страст. Ароматната ѝ композиция символизира любовта и копнежа и сякаш е създадена за силния и уверен в себе си мъж, който знае какво иска. Тайнствените нотки на аромата ще грабнат всекиго, а едно е сигурно – жените около вас няма да пропуснат присъствието ви."
                    ,ImageUrl = "https://i.imgur.com/EbSw8mR.jpg"
                    ,Price = 129.00M
                    ,BrandId = 3
                    ,CategoryId = 1
                    ,Qunatity = 200

                },new Perfume{
                    Name = "Hugo Boss Deep Red"
                    ,Desctription = "Hugo Boss Deep Red е дамски парфюм е предназначен за силните и активни жени. Представен е на пазара 2001г. Създаден е от парфюмеристите Alain Astori, Beatrice Piquet. Привлекателен и отблъскващ, дразнещ и възбуждащ, но никога незабележим аромат. Съблазнителната и възбуждаща ароматна аура, ще ви зареди с невероятно настроение и усещане за неповторима уникалност."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 49.99M
                    ,BrandId = 1
                    ,CategoryId = 2
                    ,Qunatity = 50
                },
                 new Perfume{
                    Name = "Calvin Klein In2U"
                    ,Desctription = "Calvin Klein In2U e модерен аромат насочен към младото поколение, създаден да изрази свободната воля и желанието на младите хора да изследват и опознават света.  Усеща духа и  настроението на енергичните млади мъже и жени. Представен на пазара 2007г. Свеж, динамичен, чист и тонизиращ. Прекрасно предложени за топлите месеци, ваканциите и забавленията с приятели на открито. Ароматният състав е разработен от уникален екип парфюмеристи - Bruno Jovanovic , Jean-Marc Chaillan , Loc Dong и Carlos Benaim.  Calvin Klein In2U е представен на пазара за първи път през 2007 година."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 41.99M
                    ,BrandId = 4
                    ,CategoryId = 2
                    ,Qunatity = 100
                },
                 new Perfume{
                    Name = "Hugo Boss Bottled Nigh"
                    ,Desctription = "Hugo Boss Bottled Night EDT е дървесен аромат за мъже лансиран на пазара през юли 2010 година. За младия, амбициозен, модерен мъж, който преследва целите си. Той е уверен в своите способности и знае, че всяка цел е постижима и всичко е възможно! Успехът е на една ръка разстояние от Вас! Съблазнителен и много мъжествен аромат, подчертаващ сила и чувственост. Не по-малко харизматича е бутилката - флакон, оцветен в наситени, тъмносини нюанси, обрисуващи загадачността на нощта. Неговият елегантен и благороден блясък разкрива на своя собственик тайните на прелъстяването, подготвя го за приключенията, съпътстващи тъмната част на денонощието. "
                    ,ImageUrl = "https://i.imgur.com/NgWSnk9.jpg"
                    ,Price = 59.99M
                    ,BrandId = 1
                    ,CategoryId = 1
                    ,Qunatity = 50
                },
                new Perfume{
                    Name = "Calvin Klein Encounter парфюм за мъже"
                    ,Desctription = "Calvin Klein Encounter e мистериозен, мъжествен и съблазнително секси аромат, представен на пазара през 2012 година. Разработка е на парфюмеристите Honorine Blane и Piere Negrine. Усещането за този аромат е като дългоочаквана среща между мъж и жена, заредена с много вълнение, страст и магнетизъм. Подходящ е за всички моменти, в които искате да бъдете неустоими."
                    ,ImageUrl = "https://i.imgur.com/KKVstuY.jpg"
                    ,Price = 99.99M
                    ,BrandId = 4
                    ,CategoryId = 1
                    ,Qunatity = 100
                },

                    new Perfume{
                    Name = "DIOR Sauvage"
                    ,Desctription = "Франсоа Демаши, парфюмерист на Dior, намира вдъхновението във вълшебния момент, в който здрачът се спуска над пустинята. Смесен с прохладата на нощта, изгарящият пустинен въздух носи тайнствени аромати. Момент, оцветен в тъмно синьо, който отприщва и най-смелите инстинкти. В часа, в който вълците излизат, а небето гори с лъчите на залязващото слънце, се появява нова магия."
                    ,ImageUrl = "https://i.imgur.com/Iy1QyP8.jpg"
                    ,Price = 185.00M
                    ,BrandId = 2
                    ,CategoryId = 1
                    ,Qunatity = 100
                },new Perfume{
                    Name = "Versace Eros"
                    ,Desctription = "Бъдете чувствен като гръцкия бог на любовта Ерос. Тоалетната вода за мъже Versace Eros е съвършено въплъщение на мощ и страст. Ароматната ѝ композиция символизира любовта и копнежа и сякаш е създадена за силния и уверен в себе си мъж, който знае какво иска. Тайнствените нотки на аромата ще грабнат всекиго, а едно е сигурно – жените около вас няма да пропуснат присъствието ви."
                    ,ImageUrl = "https://i.imgur.com/EbSw8mR.jpg"
                    ,Price = 129.00M
                    ,BrandId = 3
                    ,CategoryId = 1
                    ,Qunatity = 200

                },new Perfume{
                    Name = "Hugo Boss Deep Red"
                    ,Desctription = "Hugo Boss Deep Red е дамски парфюм е предназначен за силните и активни жени. Представен е на пазара 2001г. Създаден е от парфюмеристите Alain Astori, Beatrice Piquet. Привлекателен и отблъскващ, дразнещ и възбуждащ, но никога незабележим аромат. Съблазнителната и възбуждаща ароматна аура, ще ви зареди с невероятно настроение и усещане за неповторима уникалност."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 49.99M
                    ,BrandId = 1
                    ,CategoryId = 2
                    ,Qunatity = 50
                },
                 new Perfume{
                    Name = "Calvin Klein In2U"
                    ,Desctription = "Calvin Klein In2U e модерен аромат насочен към младото поколение, създаден да изрази свободната воля и желанието на младите хора да изследват и опознават света.  Усеща духа и  настроението на енергичните млади мъже и жени. Представен на пазара 2007г. Свеж, динамичен, чист и тонизиращ. Прекрасно предложени за топлите месеци, ваканциите и забавленията с приятели на открито. Ароматният състав е разработен от уникален екип парфюмеристи - Bruno Jovanovic , Jean-Marc Chaillan , Loc Dong и Carlos Benaim.  Calvin Klein In2U е представен на пазара за първи път през 2007 година."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 41.99M
                    ,BrandId = 4
                    ,CategoryId = 2
                    ,Qunatity = 100
                },
                 new Perfume{
                    Name = "Hugo Boss Bottled Nigh"
                    ,Desctription = "Hugo Boss Bottled Night EDT е дървесен аромат за мъже лансиран на пазара през юли 2010 година. За младия, амбициозен, модерен мъж, който преследва целите си. Той е уверен в своите способности и знае, че всяка цел е постижима и всичко е възможно! Успехът е на една ръка разстояние от Вас! Съблазнителен и много мъжествен аромат, подчертаващ сила и чувственост. Не по-малко харизматича е бутилката - флакон, оцветен в наситени, тъмносини нюанси, обрисуващи загадачността на нощта. Неговият елегантен и благороден блясък разкрива на своя собственик тайните на прелъстяването, подготвя го за приключенията, съпътстващи тъмната част на денонощието. "
                    ,ImageUrl = "https://i.imgur.com/NgWSnk9.jpg"
                    ,Price = 59.99M
                    ,BrandId = 1
                    ,CategoryId = 1
                    ,Qunatity = 50
                },
                new Perfume{
                    Name = "Calvin Klein Encounter парфюм за мъже"
                    ,Desctription = "Calvin Klein Encounter e мистериозен, мъжествен и съблазнително секси аромат, представен на пазара през 2012 година. Разработка е на парфюмеристите Honorine Blane и Piere Negrine. Усещането за този аромат е като дългоочаквана среща между мъж и жена, заредена с много вълнение, страст и магнетизъм. Подходящ е за всички моменти, в които искате да бъдете неустоими."
                    ,ImageUrl = "https://i.imgur.com/KKVstuY.jpg"
                    ,Price = 99.99M
                    ,BrandId = 4
                    ,CategoryId = 1
                    ,Qunatity = 100
                },

                    new Perfume{
                    Name = "DIOR Sauvage"
                    ,Desctription = "Франсоа Демаши, парфюмерист на Dior, намира вдъхновението във вълшебния момент, в който здрачът се спуска над пустинята. Смесен с прохладата на нощта, изгарящият пустинен въздух носи тайнствени аромати. Момент, оцветен в тъмно синьо, който отприщва и най-смелите инстинкти. В часа, в който вълците излизат, а небето гори с лъчите на залязващото слънце, се появява нова магия."
                    ,ImageUrl = "https://i.imgur.com/Iy1QyP8.jpg"
                    ,Price = 185.00M
                    ,BrandId = 2
                    ,CategoryId = 1
                    ,Qunatity = 100
                },new Perfume{
                    Name = "Versace Eros"
                    ,Desctription = "Бъдете чувствен като гръцкия бог на любовта Ерос. Тоалетната вода за мъже Versace Eros е съвършено въплъщение на мощ и страст. Ароматната ѝ композиция символизира любовта и копнежа и сякаш е създадена за силния и уверен в себе си мъж, който знае какво иска. Тайнствените нотки на аромата ще грабнат всекиго, а едно е сигурно – жените около вас няма да пропуснат присъствието ви."
                    ,ImageUrl = "https://i.imgur.com/EbSw8mR.jpg"
                    ,Price = 129.00M
                    ,BrandId = 3
                    ,CategoryId = 1
                    ,Qunatity = 200

                },new Perfume{
                    Name = "Hugo Boss Deep Red"
                    ,Desctription = "Hugo Boss Deep Red е дамски парфюм е предназначен за силните и активни жени. Представен е на пазара 2001г. Създаден е от парфюмеристите Alain Astori, Beatrice Piquet. Привлекателен и отблъскващ, дразнещ и възбуждащ, но никога незабележим аромат. Съблазнителната и възбуждаща ароматна аура, ще ви зареди с невероятно настроение и усещане за неповторима уникалност."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 49.99M
                    ,BrandId = 1
                    ,CategoryId = 2
                    ,Qunatity = 50
                },
                 new Perfume{
                    Name = "Calvin Klein In2U"
                    ,Desctription = "Calvin Klein In2U e модерен аромат насочен към младото поколение, създаден да изрази свободната воля и желанието на младите хора да изследват и опознават света.  Усеща духа и  настроението на енергичните млади мъже и жени. Представен на пазара 2007г. Свеж, динамичен, чист и тонизиращ. Прекрасно предложени за топлите месеци, ваканциите и забавленията с приятели на открито. Ароматният състав е разработен от уникален екип парфюмеристи - Bruno Jovanovic , Jean-Marc Chaillan , Loc Dong и Carlos Benaim.  Calvin Klein In2U е представен на пазара за първи път през 2007 година."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 41.99M
                    ,BrandId = 4
                    ,CategoryId = 2
                    ,Qunatity = 100
                },
                 new Perfume{
                    Name = "Hugo Boss Bottled Nigh"
                    ,Desctription = "Hugo Boss Bottled Night EDT е дървесен аромат за мъже лансиран на пазара през юли 2010 година. За младия, амбициозен, модерен мъж, който преследва целите си. Той е уверен в своите способности и знае, че всяка цел е постижима и всичко е възможно! Успехът е на една ръка разстояние от Вас! Съблазнителен и много мъжествен аромат, подчертаващ сила и чувственост. Не по-малко харизматича е бутилката - флакон, оцветен в наситени, тъмносини нюанси, обрисуващи загадачността на нощта. Неговият елегантен и благороден блясък разкрива на своя собственик тайните на прелъстяването, подготвя го за приключенията, съпътстващи тъмната част на денонощието. "
                    ,ImageUrl = "https://i.imgur.com/NgWSnk9.jpg"
                    ,Price = 59.99M
                    ,BrandId = 1
                    ,CategoryId = 1
                    ,Qunatity = 50
                },
                new Perfume{
                    Name = "Calvin Klein Encounter парфюм за мъже"
                    ,Desctription = "Calvin Klein Encounter e мистериозен, мъжествен и съблазнително секси аромат, представен на пазара през 2012 година. Разработка е на парфюмеристите Honorine Blane и Piere Negrine. Усещането за този аромат е като дългоочаквана среща между мъж и жена, заредена с много вълнение, страст и магнетизъм. Подходящ е за всички моменти, в които искате да бъдете неустоими."
                    ,ImageUrl = "https://i.imgur.com/KKVstuY.jpg"
                    ,Price = 99.99M
                    ,BrandId = 4
                    ,CategoryId = 1
                    ,Qunatity = 100
                },
                    new Perfume{
                    Name = "DIOR Sauvage"
                    ,Desctription = "Франсоа Демаши, парфюмерист на Dior, намира вдъхновението във вълшебния момент, в който здрачът се спуска над пустинята. Смесен с прохладата на нощта, изгарящият пустинен въздух носи тайнствени аромати. Момент, оцветен в тъмно синьо, който отприщва и най-смелите инстинкти. В часа, в който вълците излизат, а небето гори с лъчите на залязващото слънце, се появява нова магия."
                    ,ImageUrl = "https://i.imgur.com/Iy1QyP8.jpg"
                    ,Price = 185.00M
                    ,BrandId = 2
                    ,CategoryId = 1
                    ,Qunatity = 100
                },new Perfume{
                    Name = "Versace Eros"
                    ,Desctription = "Бъдете чувствен като гръцкия бог на любовта Ерос. Тоалетната вода за мъже Versace Eros е съвършено въплъщение на мощ и страст. Ароматната ѝ композиция символизира любовта и копнежа и сякаш е създадена за силния и уверен в себе си мъж, който знае какво иска. Тайнствените нотки на аромата ще грабнат всекиго, а едно е сигурно – жените около вас няма да пропуснат присъствието ви."
                    ,ImageUrl = "https://i.imgur.com/EbSw8mR.jpg"
                    ,Price = 129.00M
                    ,BrandId = 3
                    ,CategoryId = 1
                    ,Qunatity = 200

                },new Perfume{
                    Name = "Hugo Boss Deep Red"
                    ,Desctription = "Hugo Boss Deep Red е дамски парфюм е предназначен за силните и активни жени. Представен е на пазара 2001г. Създаден е от парфюмеристите Alain Astori, Beatrice Piquet. Привлекателен и отблъскващ, дразнещ и възбуждащ, но никога незабележим аромат. Съблазнителната и възбуждаща ароматна аура, ще ви зареди с невероятно настроение и усещане за неповторима уникалност."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 49.99M
                    ,BrandId = 1
                    ,CategoryId = 2
                    ,Qunatity = 50
                },
                 new Perfume{
                    Name = "Calvin Klein In2U"
                    ,Desctription = "Calvin Klein In2U e модерен аромат насочен към младото поколение, създаден да изрази свободната воля и желанието на младите хора да изследват и опознават света.  Усеща духа и  настроението на енергичните млади мъже и жени. Представен на пазара 2007г. Свеж, динамичен, чист и тонизиращ. Прекрасно предложени за топлите месеци, ваканциите и забавленията с приятели на открито. Ароматният състав е разработен от уникален екип парфюмеристи - Bruno Jovanovic , Jean-Marc Chaillan , Loc Dong и Carlos Benaim.  Calvin Klein In2U е представен на пазара за първи път през 2007 година."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 41.99M
                    ,BrandId = 4
                    ,CategoryId = 2
                    ,Qunatity = 100
                },
                 new Perfume{
                    Name = "Hugo Boss Bottled Nigh"
                    ,Desctription = "Hugo Boss Bottled Night EDT е дървесен аромат за мъже лансиран на пазара през юли 2010 година. За младия, амбициозен, модерен мъж, който преследва целите си. Той е уверен в своите способности и знае, че всяка цел е постижима и всичко е възможно! Успехът е на една ръка разстояние от Вас! Съблазнителен и много мъжествен аромат, подчертаващ сила и чувственост. Не по-малко харизматича е бутилката - флакон, оцветен в наситени, тъмносини нюанси, обрисуващи загадачността на нощта. Неговият елегантен и благороден блясък разкрива на своя собственик тайните на прелъстяването, подготвя го за приключенията, съпътстващи тъмната част на денонощието. "
                    ,ImageUrl = "https://i.imgur.com/NgWSnk9.jpg"
                    ,Price = 59.99M
                    ,BrandId = 1
                    ,CategoryId = 1
                    ,Qunatity = 50
                },
                new Perfume{
                    Name = "Calvin Klein Encounter парфюм за мъже"
                    ,Desctription = "Calvin Klein Encounter e мистериозен, мъжествен и съблазнително секси аромат, представен на пазара през 2012 година. Разработка е на парфюмеристите Honorine Blane и Piere Negrine. Усещането за този аромат е като дългоочаквана среща между мъж и жена, заредена с много вълнение, страст и магнетизъм. Подходящ е за всички моменти, в които искате да бъдете неустоими."
                    ,ImageUrl = "https://i.imgur.com/KKVstuY.jpg"
                    ,Price = 99.99M
                    ,BrandId = 4
                    ,CategoryId = 1
                    ,Qunatity = 100
                },
                   new Perfume{
                    Name = "DIOR Sauvage"
                    ,Desctription = "Франсоа Демаши, парфюмерист на Dior, намира вдъхновението във вълшебния момент, в който здрачът се спуска над пустинята. Смесен с прохладата на нощта, изгарящият пустинен въздух носи тайнствени аромати. Момент, оцветен в тъмно синьо, който отприщва и най-смелите инстинкти. В часа, в който вълците излизат, а небето гори с лъчите на залязващото слънце, се появява нова магия."
                    ,ImageUrl = "https://i.imgur.com/Iy1QyP8.jpg"
                    ,Price = 185.00M
                    ,BrandId = 2
                    ,CategoryId = 1
                    ,Qunatity = 100
                },new Perfume{
                    Name = "Versace Eros"
                    ,Desctription = "Бъдете чувствен като гръцкия бог на любовта Ерос. Тоалетната вода за мъже Versace Eros е съвършено въплъщение на мощ и страст. Ароматната ѝ композиция символизира любовта и копнежа и сякаш е създадена за силния и уверен в себе си мъж, който знае какво иска. Тайнствените нотки на аромата ще грабнат всекиго, а едно е сигурно – жените около вас няма да пропуснат присъствието ви."
                    ,ImageUrl = "https://i.imgur.com/EbSw8mR.jpg"
                    ,Price = 129.00M
                    ,BrandId = 3
                    ,CategoryId = 1
                    ,Qunatity = 200

                },new Perfume{
                    Name = "Hugo Boss Deep Red"
                    ,Desctription = "Hugo Boss Deep Red е дамски парфюм е предназначен за силните и активни жени. Представен е на пазара 2001г. Създаден е от парфюмеристите Alain Astori, Beatrice Piquet. Привлекателен и отблъскващ, дразнещ и възбуждащ, но никога незабележим аромат. Съблазнителната и възбуждаща ароматна аура, ще ви зареди с невероятно настроение и усещане за неповторима уникалност."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 49.99M
                    ,BrandId = 1
                    ,CategoryId = 2
                    ,Qunatity = 50
                },
                 new Perfume{
                    Name = "Calvin Klein In2U"
                    ,Desctription = "Calvin Klein In2U e модерен аромат насочен към младото поколение, създаден да изрази свободната воля и желанието на младите хора да изследват и опознават света.  Усеща духа и  настроението на енергичните млади мъже и жени. Представен на пазара 2007г. Свеж, динамичен, чист и тонизиращ. Прекрасно предложени за топлите месеци, ваканциите и забавленията с приятели на открито. Ароматният състав е разработен от уникален екип парфюмеристи - Bruno Jovanovic , Jean-Marc Chaillan , Loc Dong и Carlos Benaim.  Calvin Klein In2U е представен на пазара за първи път през 2007 година."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 41.99M
                    ,BrandId = 4
                    ,CategoryId = 2
                    ,Qunatity = 100
                },
                 new Perfume{
                    Name = "Hugo Boss Bottled Nigh"
                    ,Desctription = "Hugo Boss Bottled Night EDT е дървесен аромат за мъже лансиран на пазара през юли 2010 година. За младия, амбициозен, модерен мъж, който преследва целите си. Той е уверен в своите способности и знае, че всяка цел е постижима и всичко е възможно! Успехът е на една ръка разстояние от Вас! Съблазнителен и много мъжествен аромат, подчертаващ сила и чувственост. Не по-малко харизматича е бутилката - флакон, оцветен в наситени, тъмносини нюанси, обрисуващи загадачността на нощта. Неговият елегантен и благороден блясък разкрива на своя собственик тайните на прелъстяването, подготвя го за приключенията, съпътстващи тъмната част на денонощието. "
                    ,ImageUrl = "https://i.imgur.com/NgWSnk9.jpg"
                    ,Price = 59.99M
                    ,BrandId = 1
                    ,CategoryId = 1
                    ,Qunatity = 50
                },
                new Perfume{
                    Name = "Calvin Klein Encounter парфюм за мъже"
                    ,Desctription = "Calvin Klein Encounter e мистериозен, мъжествен и съблазнително секси аромат, представен на пазара през 2012 година. Разработка е на парфюмеристите Honorine Blane и Piere Negrine. Усещането за този аромат е като дългоочаквана среща между мъж и жена, заредена с много вълнение, страст и магнетизъм. Подходящ е за всички моменти, в които искате да бъдете неустоими."
                    ,ImageUrl = "https://i.imgur.com/KKVstuY.jpg"
                    ,Price = 99.99M
                    ,BrandId = 4
                    ,CategoryId = 1
                    ,Qunatity = 100
                },

                    new Perfume{
                    Name = "DIOR Sauvage"
                    ,Desctription = "Франсоа Демаши, парфюмерист на Dior, намира вдъхновението във вълшебния момент, в който здрачът се спуска над пустинята. Смесен с прохладата на нощта, изгарящият пустинен въздух носи тайнствени аромати. Момент, оцветен в тъмно синьо, който отприщва и най-смелите инстинкти. В часа, в който вълците излизат, а небето гори с лъчите на залязващото слънце, се появява нова магия."
                    ,ImageUrl = "https://i.imgur.com/Iy1QyP8.jpg"
                    ,Price = 185.00M
                    ,BrandId = 2
                    ,CategoryId = 1
                    ,Qunatity = 100
                },new Perfume{
                    Name = "Versace Eros"
                    ,Desctription = "Бъдете чувствен като гръцкия бог на любовта Ерос. Тоалетната вода за мъже Versace Eros е съвършено въплъщение на мощ и страст. Ароматната ѝ композиция символизира любовта и копнежа и сякаш е създадена за силния и уверен в себе си мъж, който знае какво иска. Тайнствените нотки на аромата ще грабнат всекиго, а едно е сигурно – жените около вас няма да пропуснат присъствието ви."
                    ,ImageUrl = "https://i.imgur.com/EbSw8mR.jpg"
                    ,Price = 129.00M
                    ,BrandId = 3
                    ,CategoryId = 1
                    ,Qunatity = 200

                },new Perfume{
                    Name = "Hugo Boss Deep Red"
                    ,Desctription = "Hugo Boss Deep Red е дамски парфюм е предназначен за силните и активни жени. Представен е на пазара 2001г. Създаден е от парфюмеристите Alain Astori, Beatrice Piquet. Привлекателен и отблъскващ, дразнещ и възбуждащ, но никога незабележим аромат. Съблазнителната и възбуждаща ароматна аура, ще ви зареди с невероятно настроение и усещане за неповторима уникалност."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 49.99M
                    ,BrandId = 1
                    ,CategoryId = 2
                    ,Qunatity = 50
                },
                 new Perfume{
                    Name = "Calvin Klein In2U"
                    ,Desctription = "Calvin Klein In2U e модерен аромат насочен към младото поколение, създаден да изрази свободната воля и желанието на младите хора да изследват и опознават света.  Усеща духа и  настроението на енергичните млади мъже и жени. Представен на пазара 2007г. Свеж, динамичен, чист и тонизиращ. Прекрасно предложени за топлите месеци, ваканциите и забавленията с приятели на открито. Ароматният състав е разработен от уникален екип парфюмеристи - Bruno Jovanovic , Jean-Marc Chaillan , Loc Dong и Carlos Benaim.  Calvin Klein In2U е представен на пазара за първи път през 2007 година."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 41.99M
                    ,BrandId = 4
                    ,CategoryId = 2
                    ,Qunatity = 100
                },
                 new Perfume{
                    Name = "Hugo Boss Bottled Nigh"
                    ,Desctription = "Hugo Boss Bottled Night EDT е дървесен аромат за мъже лансиран на пазара през юли 2010 година. За младия, амбициозен, модерен мъж, който преследва целите си. Той е уверен в своите способности и знае, че всяка цел е постижима и всичко е възможно! Успехът е на една ръка разстояние от Вас! Съблазнителен и много мъжествен аромат, подчертаващ сила и чувственост. Не по-малко харизматича е бутилката - флакон, оцветен в наситени, тъмносини нюанси, обрисуващи загадачността на нощта. Неговият елегантен и благороден блясък разкрива на своя собственик тайните на прелъстяването, подготвя го за приключенията, съпътстващи тъмната част на денонощието. "
                    ,ImageUrl = "https://i.imgur.com/NgWSnk9.jpg"
                    ,Price = 59.99M
                    ,BrandId = 1
                    ,CategoryId = 1
                    ,Qunatity = 50
                },
                new Perfume{
                    Name = "Calvin Klein Encounter парфюм за мъже"
                    ,Desctription = "Calvin Klein Encounter e мистериозен, мъжествен и съблазнително секси аромат, представен на пазара през 2012 година. Разработка е на парфюмеристите Honorine Blane и Piere Negrine. Усещането за този аромат е като дългоочаквана среща между мъж и жена, заредена с много вълнение, страст и магнетизъм. Подходящ е за всички моменти, в които искате да бъдете неустоими."
                    ,ImageUrl = "https://i.imgur.com/KKVstuY.jpg"
                    ,Price = 99.99M
                    ,BrandId = 4
                    ,CategoryId = 1
                    ,Qunatity = 100
                },

                    new Perfume{
                    Name = "DIOR Sauvage"
                    ,Desctription = "Франсоа Демаши, парфюмерист на Dior, намира вдъхновението във вълшебния момент, в който здрачът се спуска над пустинята. Смесен с прохладата на нощта, изгарящият пустинен въздух носи тайнствени аромати. Момент, оцветен в тъмно синьо, който отприщва и най-смелите инстинкти. В часа, в който вълците излизат, а небето гори с лъчите на залязващото слънце, се появява нова магия."
                    ,ImageUrl = "https://i.imgur.com/Iy1QyP8.jpg"
                    ,Price = 185.00M
                    ,BrandId = 2
                    ,CategoryId = 1
                    ,Qunatity = 100
                },new Perfume{
                    Name = "Versace Eros"
                    ,Desctription = "Бъдете чувствен като гръцкия бог на любовта Ерос. Тоалетната вода за мъже Versace Eros е съвършено въплъщение на мощ и страст. Ароматната ѝ композиция символизира любовта и копнежа и сякаш е създадена за силния и уверен в себе си мъж, който знае какво иска. Тайнствените нотки на аромата ще грабнат всекиго, а едно е сигурно – жените около вас няма да пропуснат присъствието ви."
                    ,ImageUrl = "https://i.imgur.com/EbSw8mR.jpg"
                    ,Price = 129.00M
                    ,BrandId = 3
                    ,CategoryId = 1
                    ,Qunatity = 200

                },new Perfume{
                    Name = "Hugo Boss Deep Red"
                    ,Desctription = "Hugo Boss Deep Red е дамски парфюм е предназначен за силните и активни жени. Представен е на пазара 2001г. Създаден е от парфюмеристите Alain Astori, Beatrice Piquet. Привлекателен и отблъскващ, дразнещ и възбуждащ, но никога незабележим аромат. Съблазнителната и възбуждаща ароматна аура, ще ви зареди с невероятно настроение и усещане за неповторима уникалност."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 49.99M
                    ,BrandId = 1
                    ,CategoryId = 2
                    ,Qunatity = 50
                },
                 new Perfume{
                    Name = "Calvin Klein In2U"
                    ,Desctription = "Calvin Klein In2U e модерен аромат насочен към младото поколение, създаден да изрази свободната воля и желанието на младите хора да изследват и опознават света.  Усеща духа и  настроението на енергичните млади мъже и жени. Представен на пазара 2007г. Свеж, динамичен, чист и тонизиращ. Прекрасно предложени за топлите месеци, ваканциите и забавленията с приятели на открито. Ароматният състав е разработен от уникален екип парфюмеристи - Bruno Jovanovic , Jean-Marc Chaillan , Loc Dong и Carlos Benaim.  Calvin Klein In2U е представен на пазара за първи път през 2007 година."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 41.99M
                    ,BrandId = 4
                    ,CategoryId = 2
                    ,Qunatity = 100
                },
                 new Perfume{
                    Name = "Hugo Boss Bottled Nigh"
                    ,Desctription = "Hugo Boss Bottled Night EDT е дървесен аромат за мъже лансиран на пазара през юли 2010 година. За младия, амбициозен, модерен мъж, който преследва целите си. Той е уверен в своите способности и знае, че всяка цел е постижима и всичко е възможно! Успехът е на една ръка разстояние от Вас! Съблазнителен и много мъжествен аромат, подчертаващ сила и чувственост. Не по-малко харизматича е бутилката - флакон, оцветен в наситени, тъмносини нюанси, обрисуващи загадачността на нощта. Неговият елегантен и благороден блясък разкрива на своя собственик тайните на прелъстяването, подготвя го за приключенията, съпътстващи тъмната част на денонощието. "
                    ,ImageUrl = "https://i.imgur.com/NgWSnk9.jpg"
                    ,Price = 59.99M
                    ,BrandId = 1
                    ,CategoryId = 1
                    ,Qunatity = 50
                },
                new Perfume{
                    Name = "Calvin Klein Encounter парфюм за мъже"
                    ,Desctription = "Calvin Klein Encounter e мистериозен, мъжествен и съблазнително секси аромат, представен на пазара през 2012 година. Разработка е на парфюмеристите Honorine Blane и Piere Negrine. Усещането за този аромат е като дългоочаквана среща между мъж и жена, заредена с много вълнение, страст и магнетизъм. Подходящ е за всички моменти, в които искате да бъдете неустоими."
                    ,ImageUrl = "https://i.imgur.com/KKVstuY.jpg"
                    ,Price = 99.99M
                    ,BrandId = 4
                    ,CategoryId = 1
                    ,Qunatity = 100
                },
                    new Perfume{
                    Name = "DIOR Sauvage"
                    ,Desctription = "Франсоа Демаши, парфюмерист на Dior, намира вдъхновението във вълшебния момент, в който здрачът се спуска над пустинята. Смесен с прохладата на нощта, изгарящият пустинен въздух носи тайнствени аромати. Момент, оцветен в тъмно синьо, който отприщва и най-смелите инстинкти. В часа, в който вълците излизат, а небето гори с лъчите на залязващото слънце, се появява нова магия."
                    ,ImageUrl = "https://i.imgur.com/Iy1QyP8.jpg"
                    ,Price = 185.00M
                    ,BrandId = 2
                    ,CategoryId = 1
                    ,Qunatity = 100
                },new Perfume{
                    Name = "Versace Eros"
                    ,Desctription = "Бъдете чувствен като гръцкия бог на любовта Ерос. Тоалетната вода за мъже Versace Eros е съвършено въплъщение на мощ и страст. Ароматната ѝ композиция символизира любовта и копнежа и сякаш е създадена за силния и уверен в себе си мъж, който знае какво иска. Тайнствените нотки на аромата ще грабнат всекиго, а едно е сигурно – жените около вас няма да пропуснат присъствието ви."
                    ,ImageUrl = "https://i.imgur.com/EbSw8mR.jpg"
                    ,Price = 129.00M
                    ,BrandId = 3
                    ,CategoryId = 1
                    ,Qunatity = 200

                },new Perfume{
                    Name = "Hugo Boss Deep Red"
                    ,Desctription = "Hugo Boss Deep Red е дамски парфюм е предназначен за силните и активни жени. Представен е на пазара 2001г. Създаден е от парфюмеристите Alain Astori, Beatrice Piquet. Привлекателен и отблъскващ, дразнещ и възбуждащ, но никога незабележим аромат. Съблазнителната и възбуждаща ароматна аура, ще ви зареди с невероятно настроение и усещане за неповторима уникалност."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 49.99M
                    ,BrandId = 1
                    ,CategoryId = 2
                    ,Qunatity = 50
                },
                 new Perfume{
                    Name = "Calvin Klein In2U"
                    ,Desctription = "Calvin Klein In2U e модерен аромат насочен към младото поколение, създаден да изрази свободната воля и желанието на младите хора да изследват и опознават света.  Усеща духа и  настроението на енергичните млади мъже и жени. Представен на пазара 2007г. Свеж, динамичен, чист и тонизиращ. Прекрасно предложени за топлите месеци, ваканциите и забавленията с приятели на открито. Ароматният състав е разработен от уникален екип парфюмеристи - Bruno Jovanovic , Jean-Marc Chaillan , Loc Dong и Carlos Benaim.  Calvin Klein In2U е представен на пазара за първи път през 2007 година."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 41.99M
                    ,BrandId = 4
                    ,CategoryId = 2
                    ,Qunatity = 100
                },
                 new Perfume{
                    Name = "Hugo Boss Bottled Nigh"
                    ,Desctription = "Hugo Boss Bottled Night EDT е дървесен аромат за мъже лансиран на пазара през юли 2010 година. За младия, амбициозен, модерен мъж, който преследва целите си. Той е уверен в своите способности и знае, че всяка цел е постижима и всичко е възможно! Успехът е на една ръка разстояние от Вас! Съблазнителен и много мъжествен аромат, подчертаващ сила и чувственост. Не по-малко харизматича е бутилката - флакон, оцветен в наситени, тъмносини нюанси, обрисуващи загадачността на нощта. Неговият елегантен и благороден блясък разкрива на своя собственик тайните на прелъстяването, подготвя го за приключенията, съпътстващи тъмната част на денонощието. "
                    ,ImageUrl = "https://i.imgur.com/NgWSnk9.jpg"
                    ,Price = 59.99M
                    ,BrandId = 1
                    ,CategoryId = 1
                    ,Qunatity = 50
                },
                new Perfume{
                    Name = "Calvin Klein Encounter парфюм за мъже"
                    ,Desctription = "Calvin Klein Encounter e мистериозен, мъжествен и съблазнително секси аромат, представен на пазара през 2012 година. Разработка е на парфюмеристите Honorine Blane и Piere Negrine. Усещането за този аромат е като дългоочаквана среща между мъж и жена, заредена с много вълнение, страст и магнетизъм. Подходящ е за всички моменти, в които искате да бъдете неустоими."
                    ,ImageUrl = "https://i.imgur.com/KKVstuY.jpg"
                    ,Price = 99.99M
                    ,BrandId = 4
                    ,CategoryId = 1
                    ,Qunatity = 100
                },
                   new Perfume{
                    Name = "DIOR Sauvage"
                    ,Desctription = "Франсоа Демаши, парфюмерист на Dior, намира вдъхновението във вълшебния момент, в който здрачът се спуска над пустинята. Смесен с прохладата на нощта, изгарящият пустинен въздух носи тайнствени аромати. Момент, оцветен в тъмно синьо, който отприщва и най-смелите инстинкти. В часа, в който вълците излизат, а небето гори с лъчите на залязващото слънце, се появява нова магия."
                    ,ImageUrl = "https://i.imgur.com/Iy1QyP8.jpg"
                    ,Price = 185.00M
                    ,BrandId = 2
                    ,CategoryId = 1
                    ,Qunatity = 100
                },new Perfume{
                    Name = "Versace Eros"
                    ,Desctription = "Бъдете чувствен като гръцкия бог на любовта Ерос. Тоалетната вода за мъже Versace Eros е съвършено въплъщение на мощ и страст. Ароматната ѝ композиция символизира любовта и копнежа и сякаш е създадена за силния и уверен в себе си мъж, който знае какво иска. Тайнствените нотки на аромата ще грабнат всекиго, а едно е сигурно – жените около вас няма да пропуснат присъствието ви."
                    ,ImageUrl = "https://i.imgur.com/EbSw8mR.jpg"
                    ,Price = 129.00M
                    ,BrandId = 3
                    ,CategoryId = 1
                    ,Qunatity = 200

                },new Perfume{
                    Name = "Hugo Boss Deep Red"
                    ,Desctription = "Hugo Boss Deep Red е дамски парфюм е предназначен за силните и активни жени. Представен е на пазара 2001г. Създаден е от парфюмеристите Alain Astori, Beatrice Piquet. Привлекателен и отблъскващ, дразнещ и възбуждащ, но никога незабележим аромат. Съблазнителната и възбуждаща ароматна аура, ще ви зареди с невероятно настроение и усещане за неповторима уникалност."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 49.99M
                    ,BrandId = 1
                    ,CategoryId = 2
                    ,Qunatity = 50
                },
                 new Perfume{
                    Name = "Calvin Klein In2U"
                    ,Desctription = "Calvin Klein In2U e модерен аромат насочен към младото поколение, създаден да изрази свободната воля и желанието на младите хора да изследват и опознават света.  Усеща духа и  настроението на енергичните млади мъже и жени. Представен на пазара 2007г. Свеж, динамичен, чист и тонизиращ. Прекрасно предложени за топлите месеци, ваканциите и забавленията с приятели на открито. Ароматният състав е разработен от уникален екип парфюмеристи - Bruno Jovanovic , Jean-Marc Chaillan , Loc Dong и Carlos Benaim.  Calvin Klein In2U е представен на пазара за първи път през 2007 година."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 41.99M
                    ,BrandId = 4
                    ,CategoryId = 2
                    ,Qunatity = 100
                },
                 new Perfume{
                    Name = "Hugo Boss Bottled Nigh"
                    ,Desctription = "Hugo Boss Bottled Night EDT е дървесен аромат за мъже лансиран на пазара през юли 2010 година. За младия, амбициозен, модерен мъж, който преследва целите си. Той е уверен в своите способности и знае, че всяка цел е постижима и всичко е възможно! Успехът е на една ръка разстояние от Вас! Съблазнителен и много мъжествен аромат, подчертаващ сила и чувственост. Не по-малко харизматича е бутилката - флакон, оцветен в наситени, тъмносини нюанси, обрисуващи загадачността на нощта. Неговият елегантен и благороден блясък разкрива на своя собственик тайните на прелъстяването, подготвя го за приключенията, съпътстващи тъмната част на денонощието. "
                    ,ImageUrl = "https://i.imgur.com/NgWSnk9.jpg"
                    ,Price = 59.99M
                    ,BrandId = 1
                    ,CategoryId = 1
                    ,Qunatity = 50
                },
                new Perfume{
                    Name = "Calvin Klein Encounter парфюм за мъже"
                    ,Desctription = "Calvin Klein Encounter e мистериозен, мъжествен и съблазнително секси аромат, представен на пазара през 2012 година. Разработка е на парфюмеристите Honorine Blane и Piere Negrine. Усещането за този аромат е като дългоочаквана среща между мъж и жена, заредена с много вълнение, страст и магнетизъм. Подходящ е за всички моменти, в които искате да бъдете неустоими."
                    ,ImageUrl = "https://i.imgur.com/KKVstuY.jpg"
                    ,Price = 99.99M
                    ,BrandId = 4
                    ,CategoryId = 1
                    ,Qunatity = 100
                },

                    new Perfume{
                    Name = "DIOR Sauvage"
                    ,Desctription = "Франсоа Демаши, парфюмерист на Dior, намира вдъхновението във вълшебния момент, в който здрачът се спуска над пустинята. Смесен с прохладата на нощта, изгарящият пустинен въздух носи тайнствени аромати. Момент, оцветен в тъмно синьо, който отприщва и най-смелите инстинкти. В часа, в който вълците излизат, а небето гори с лъчите на залязващото слънце, се появява нова магия."
                    ,ImageUrl = "https://i.imgur.com/Iy1QyP8.jpg"
                    ,Price = 185.00M
                    ,BrandId = 2
                    ,CategoryId = 1
                    ,Qunatity = 100
                },new Perfume{
                    Name = "Versace Eros"
                    ,Desctription = "Бъдете чувствен като гръцкия бог на любовта Ерос. Тоалетната вода за мъже Versace Eros е съвършено въплъщение на мощ и страст. Ароматната ѝ композиция символизира любовта и копнежа и сякаш е създадена за силния и уверен в себе си мъж, който знае какво иска. Тайнствените нотки на аромата ще грабнат всекиго, а едно е сигурно – жените около вас няма да пропуснат присъствието ви."
                    ,ImageUrl = "https://i.imgur.com/EbSw8mR.jpg"
                    ,Price = 129.00M
                    ,BrandId = 3
                    ,CategoryId = 1
                    ,Qunatity = 200

                },new Perfume{
                    Name = "Hugo Boss Deep Red"
                    ,Desctription = "Hugo Boss Deep Red е дамски парфюм е предназначен за силните и активни жени. Представен е на пазара 2001г. Създаден е от парфюмеристите Alain Astori, Beatrice Piquet. Привлекателен и отблъскващ, дразнещ и възбуждащ, но никога незабележим аромат. Съблазнителната и възбуждаща ароматна аура, ще ви зареди с невероятно настроение и усещане за неповторима уникалност."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 49.99M
                    ,BrandId = 1
                    ,CategoryId = 2
                    ,Qunatity = 50
                },
                 new Perfume{
                    Name = "Calvin Klein In2U"
                    ,Desctription = "Calvin Klein In2U e модерен аромат насочен към младото поколение, създаден да изрази свободната воля и желанието на младите хора да изследват и опознават света.  Усеща духа и  настроението на енергичните млади мъже и жени. Представен на пазара 2007г. Свеж, динамичен, чист и тонизиращ. Прекрасно предложени за топлите месеци, ваканциите и забавленията с приятели на открито. Ароматният състав е разработен от уникален екип парфюмеристи - Bruno Jovanovic , Jean-Marc Chaillan , Loc Dong и Carlos Benaim.  Calvin Klein In2U е представен на пазара за първи път през 2007 година."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 41.99M
                    ,BrandId = 4
                    ,CategoryId = 2
                    ,Qunatity = 100
                },
                 new Perfume{
                    Name = "Hugo Boss Bottled Nigh"
                    ,Desctription = "Hugo Boss Bottled Night EDT е дървесен аромат за мъже лансиран на пазара през юли 2010 година. За младия, амбициозен, модерен мъж, който преследва целите си. Той е уверен в своите способности и знае, че всяка цел е постижима и всичко е възможно! Успехът е на една ръка разстояние от Вас! Съблазнителен и много мъжествен аромат, подчертаващ сила и чувственост. Не по-малко харизматича е бутилката - флакон, оцветен в наситени, тъмносини нюанси, обрисуващи загадачността на нощта. Неговият елегантен и благороден блясък разкрива на своя собственик тайните на прелъстяването, подготвя го за приключенията, съпътстващи тъмната част на денонощието. "
                    ,ImageUrl = "https://i.imgur.com/NgWSnk9.jpg"
                    ,Price = 59.99M
                    ,BrandId = 1
                    ,CategoryId = 1
                    ,Qunatity = 50
                },
                new Perfume{
                    Name = "Calvin Klein Encounter парфюм за мъже"
                    ,Desctription = "Calvin Klein Encounter e мистериозен, мъжествен и съблазнително секси аромат, представен на пазара през 2012 година. Разработка е на парфюмеристите Honorine Blane и Piere Negrine. Усещането за този аромат е като дългоочаквана среща между мъж и жена, заредена с много вълнение, страст и магнетизъм. Подходящ е за всички моменти, в които искате да бъдете неустоими."
                    ,ImageUrl = "https://i.imgur.com/KKVstuY.jpg"
                    ,Price = 99.99M
                    ,BrandId = 4
                    ,CategoryId = 1
                    ,Qunatity = 100
                },

                    new Perfume{
                    Name = "DIOR Sauvage"
                    ,Desctription = "Франсоа Демаши, парфюмерист на Dior, намира вдъхновението във вълшебния момент, в който здрачът се спуска над пустинята. Смесен с прохладата на нощта, изгарящият пустинен въздух носи тайнствени аромати. Момент, оцветен в тъмно синьо, който отприщва и най-смелите инстинкти. В часа, в който вълците излизат, а небето гори с лъчите на залязващото слънце, се появява нова магия."
                    ,ImageUrl = "https://i.imgur.com/Iy1QyP8.jpg"
                    ,Price = 185.00M
                    ,BrandId = 2
                    ,CategoryId = 1
                    ,Qunatity = 100
                },new Perfume{
                    Name = "Versace Eros"
                    ,Desctription = "Бъдете чувствен като гръцкия бог на любовта Ерос. Тоалетната вода за мъже Versace Eros е съвършено въплъщение на мощ и страст. Ароматната ѝ композиция символизира любовта и копнежа и сякаш е създадена за силния и уверен в себе си мъж, който знае какво иска. Тайнствените нотки на аромата ще грабнат всекиго, а едно е сигурно – жените около вас няма да пропуснат присъствието ви."
                    ,ImageUrl = "https://i.imgur.com/EbSw8mR.jpg"
                    ,Price = 129.00M
                    ,BrandId = 3
                    ,CategoryId = 1
                    ,Qunatity = 200

                },new Perfume{
                    Name = "Hugo Boss Deep Red"
                    ,Desctription = "Hugo Boss Deep Red е дамски парфюм е предназначен за силните и активни жени. Представен е на пазара 2001г. Създаден е от парфюмеристите Alain Astori, Beatrice Piquet. Привлекателен и отблъскващ, дразнещ и възбуждащ, но никога незабележим аромат. Съблазнителната и възбуждаща ароматна аура, ще ви зареди с невероятно настроение и усещане за неповторима уникалност."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 49.99M
                    ,BrandId = 1
                    ,CategoryId = 2
                    ,Qunatity = 50
                },
                 new Perfume{
                    Name = "Calvin Klein In2U"
                    ,Desctription = "Calvin Klein In2U e модерен аромат насочен към младото поколение, създаден да изрази свободната воля и желанието на младите хора да изследват и опознават света.  Усеща духа и  настроението на енергичните млади мъже и жени. Представен на пазара 2007г. Свеж, динамичен, чист и тонизиращ. Прекрасно предложени за топлите месеци, ваканциите и забавленията с приятели на открито. Ароматният състав е разработен от уникален екип парфюмеристи - Bruno Jovanovic , Jean-Marc Chaillan , Loc Dong и Carlos Benaim.  Calvin Klein In2U е представен на пазара за първи път през 2007 година."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 41.99M
                    ,BrandId = 4
                    ,CategoryId = 2
                    ,Qunatity = 100
                },
                 new Perfume{
                    Name = "Hugo Boss Bottled Nigh"
                    ,Desctription = "Hugo Boss Bottled Night EDT е дървесен аромат за мъже лансиран на пазара през юли 2010 година. За младия, амбициозен, модерен мъж, който преследва целите си. Той е уверен в своите способности и знае, че всяка цел е постижима и всичко е възможно! Успехът е на една ръка разстояние от Вас! Съблазнителен и много мъжествен аромат, подчертаващ сила и чувственост. Не по-малко харизматича е бутилката - флакон, оцветен в наситени, тъмносини нюанси, обрисуващи загадачността на нощта. Неговият елегантен и благороден блясък разкрива на своя собственик тайните на прелъстяването, подготвя го за приключенията, съпътстващи тъмната част на денонощието. "
                    ,ImageUrl = "https://i.imgur.com/NgWSnk9.jpg"
                    ,Price = 59.99M
                    ,BrandId = 1
                    ,CategoryId = 1
                    ,Qunatity = 50
                },
                new Perfume{
                    Name = "Calvin Klein Encounter парфюм за мъже"
                    ,Desctription = "Calvin Klein Encounter e мистериозен, мъжествен и съблазнително секси аромат, представен на пазара през 2012 година. Разработка е на парфюмеристите Honorine Blane и Piere Negrine. Усещането за този аромат е като дългоочаквана среща между мъж и жена, заредена с много вълнение, страст и магнетизъм. Подходящ е за всички моменти, в които искате да бъдете неустоими."
                    ,ImageUrl = "https://i.imgur.com/KKVstuY.jpg"
                    ,Price = 99.99M
                    ,BrandId = 4
                    ,CategoryId = 1
                    ,Qunatity = 100
                },
                    new Perfume{
                    Name = "DIOR Sauvage"
                    ,Desctription = "Франсоа Демаши, парфюмерист на Dior, намира вдъхновението във вълшебния момент, в който здрачът се спуска над пустинята. Смесен с прохладата на нощта, изгарящият пустинен въздух носи тайнствени аромати. Момент, оцветен в тъмно синьо, който отприщва и най-смелите инстинкти. В часа, в който вълците излизат, а небето гори с лъчите на залязващото слънце, се появява нова магия."
                    ,ImageUrl = "https://i.imgur.com/Iy1QyP8.jpg"
                    ,Price = 185.00M
                    ,BrandId = 2
                    ,CategoryId = 1
                    ,Qunatity = 100
                },new Perfume{
                    Name = "Versace Eros"
                    ,Desctription = "Бъдете чувствен като гръцкия бог на любовта Ерос. Тоалетната вода за мъже Versace Eros е съвършено въплъщение на мощ и страст. Ароматната ѝ композиция символизира любовта и копнежа и сякаш е създадена за силния и уверен в себе си мъж, който знае какво иска. Тайнствените нотки на аромата ще грабнат всекиго, а едно е сигурно – жените около вас няма да пропуснат присъствието ви."
                    ,ImageUrl = "https://i.imgur.com/EbSw8mR.jpg"
                    ,Price = 129.00M
                    ,BrandId = 3
                    ,CategoryId = 1
                    ,Qunatity = 200

                },new Perfume{
                    Name = "Hugo Boss Deep Red"
                    ,Desctription = "Hugo Boss Deep Red е дамски парфюм е предназначен за силните и активни жени. Представен е на пазара 2001г. Създаден е от парфюмеристите Alain Astori, Beatrice Piquet. Привлекателен и отблъскващ, дразнещ и възбуждащ, но никога незабележим аромат. Съблазнителната и възбуждаща ароматна аура, ще ви зареди с невероятно настроение и усещане за неповторима уникалност."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 49.99M
                    ,BrandId = 1
                    ,CategoryId = 2
                    ,Qunatity = 50
                },
                 new Perfume{
                    Name = "Calvin Klein In2U"
                    ,Desctription = "Calvin Klein In2U e модерен аромат насочен към младото поколение, създаден да изрази свободната воля и желанието на младите хора да изследват и опознават света.  Усеща духа и  настроението на енергичните млади мъже и жени. Представен на пазара 2007г. Свеж, динамичен, чист и тонизиращ. Прекрасно предложени за топлите месеци, ваканциите и забавленията с приятели на открито. Ароматният състав е разработен от уникален екип парфюмеристи - Bruno Jovanovic , Jean-Marc Chaillan , Loc Dong и Carlos Benaim.  Calvin Klein In2U е представен на пазара за първи път през 2007 година."
                    ,ImageUrl = "https://i.imgur.com/13e6KTB.jpg"
                    ,Price = 41.99M
                    ,BrandId = 4
                    ,CategoryId = 2
                    ,Qunatity = 100
                },
                 new Perfume{
                    Name = "Hugo Boss Bottled Nigh"
                    ,Desctription = "Hugo Boss Bottled Night EDT е дървесен аромат за мъже лансиран на пазара през юли 2010 година. За младия, амбициозен, модерен мъж, който преследва целите си. Той е уверен в своите способности и знае, че всяка цел е постижима и всичко е възможно! Успехът е на една ръка разстояние от Вас! Съблазнителен и много мъжествен аромат, подчертаващ сила и чувственост. Не по-малко харизматича е бутилката - флакон, оцветен в наситени, тъмносини нюанси, обрисуващи загадачността на нощта. Неговият елегантен и благороден блясък разкрива на своя собственик тайните на прелъстяването, подготвя го за приключенията, съпътстващи тъмната част на денонощието. "
                    ,ImageUrl = "https://i.imgur.com/NgWSnk9.jpg"
                    ,Price = 59.99M
                    ,BrandId = 1
                    ,CategoryId = 1
                    ,Qunatity = 50
                },
                new Perfume{
                    Name = "Calvin Klein Encounter парфюм за мъже"
                    ,Desctription = "Calvin Klein Encounter e мистериозен, мъжествен и съблазнително секси аромат, представен на пазара през 2012 година. Разработка е на парфюмеристите Honorine Blane и Piere Negrine. Усещането за този аромат е като дългоочаквана среща между мъж и жена, заредена с много вълнение, страст и магнетизъм. Подходящ е за всички моменти, в които искате да бъдете неустоими."
                    ,ImageUrl = "https://i.imgur.com/KKVstuY.jpg"
                    ,Price = 99.99M
                    ,BrandId = 4
                    ,CategoryId = 1
                    ,Qunatity = 100
                },
            });

            data.SaveChanges();
        }
    }
}
